///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// /**
//  * basic single export
//  *
//  *
//  */
//
// export const name = 'alpha';
// export const age = 18;


//-------------------------------------------------------------------------------------------------------------------//


// const gender = 'male';
//
// function sayHi() {
//
//    return  'hello world';
// }
//
// /**
//  * basic multiple export
//  *
//  *
//  */
//
// export {
//
//     gender, sayHi
// }


//-------------------------------------------------------------------------------------------------------------------//


// /**
//  * Default Export
//  *
//  *
//  * 每个模块，除了允许有多个基本导出以外，还允许有一个默认导出
//  *
//  * 默认导出类似于 CommonJS 中的 module.exports               // 由于只有一个，因此无需具名
//  */
//
// export function sayYes() {
//
//     return 'yes';
// }
//
// const user = {
//
//     name: 'alpha',
//     age: 18,
//     gender: 'male'
//
// };
//
// export default user;
//
// // export {user as default};        //  每个模块有且仅有一个  '默认导出'，因此每个模块不允许有多个默认导出的语句


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
